Revit 2027 API
Viewport.ViewPosition Property
 Specifies view's position. Default is set to XYZ.Zero.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ ViewPosition { get; }
Public ReadOnly Property ViewPosition As XYZ
	Get
public:
property XYZ^ ViewPosition {
	XYZ^ get ();
}
member ViewPosition : XYZ with get
Property Value
XYZ
See Also
Reference
Viewport Class
Autodesk.Revit.DB Namespace